Сбор прогнозов с разных источников

Прогнозы можно будет собирать с разных источников, полный список планируемых источников:

- [https://betauth.com/](https://betauth.com/)
- [https://vprognoze.ru/](https://vprognoze.ru/)
- [https://www.timeform.com/](https://www.timeform.com/)
- [https://bookmaker-ratings.com.ua/](https://bookmaker-ratings.com.ua/)

Сбор будет осуществляется с разных источников (сайты, паблики). Скрипт позволит публиковать их на сайт. Также есть возможность ручного редактирования. Важно,что обработка информации будет автоматическая. Для каждого источника придётся настраивать свои параметры.

Какая будет доступна информация:

1. Заголовок прогноза по шаблону;

2. Описание прогноза;

3. Статистика каппера.

4. Проходимость встреч;

5. Комментарии для пользователей.

6. Информация о матче: 1. вид спорта 2. лига 3. Название команд 4. дата

8. Статистики по спортивному событию

**Возможные проблемы:**

Часть прогнозов будет приходить в формате обычного текста. Такие прогнозы будут без определения исхода автоматически – в формате обычных постов.

Разумеется, скрипт может работать не всегда на 100%. Поэтому будет возможность ручного редактирования прогноза.

К сожалению, при сборе информации не будет структурированной информации.
